; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph3 - mode
	image4 - mode
	thermograph2 - mode
	infrared0 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star6 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star6)
	(supports instrument1 infrared0)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star16)
)
(:goal (and
	(have_image Phenomenon7 image1)
	(have_image Phenomenon8 image4)
	(have_image Planet9 image4)
	(have_image Star10 image4)
	(have_image Star11 image4)
	(have_image Star12 image4)
	(have_image Phenomenon13 thermograph3)
	(have_image Phenomenon14 infrared0)
	(have_image Planet15 image1)
	(have_image Star16 image1)
))

)

; plan
1. (turn_to satellite0 star1 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star1)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 star16 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star16)
   goals met: 0 of 10
5. (take_image satellite0 star16 instrument0 image1)
   added: (have_image star16 image1)
   goals met: 1 of 10
6. (turn_to satellite0 planet15 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 planet15)
   goals met: 1 of 10
7. (take_image satellite0 planet15 instrument0 image1)
   added: (have_image planet15 image1)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon7 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon7 instrument0 image1)
   added: (have_image phenomenon7 image1)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon13 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon13 instrument0 thermograph3)
   added: (have_image phenomenon13 thermograph3)
   goals met: 4 of 10
12. (turn_to satellite0 groundstation2 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 10
13. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 10
14. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 10
15. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 4 of 10
16. (turn_to satellite0 phenomenon14 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 10
17. (take_image satellite0 phenomenon14 instrument1 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 5 of 10
18. (turn_to satellite0 phenomenon8 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon8)
   goals met: 5 of 10
19. (take_image satellite0 phenomenon8 instrument1 image4)
   added: (have_image phenomenon8 image4)
   goals met: 6 of 10
20. (turn_to satellite0 planet9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet9)
   goals met: 6 of 10
21. (take_image satellite0 planet9 instrument1 image4)
   added: (have_image planet9 image4)
   goals met: 7 of 10
22. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 7 of 10
23. (take_image satellite0 star10 instrument1 image4)
   added: (have_image star10 image4)
   goals met: 8 of 10
24. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 8 of 10
25. (take_image satellite0 star11 instrument1 image4)
   added: (have_image star11 image4)
   goals met: 9 of 10
26. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 9 of 10
27. (take_image satellite0 star12 instrument1 image4)
   added: (have_image star12 image4)
   goals met: 10 of 10
